#+TITLE:
#+AUTHOR: 
#+EMAIL: 
#+KEYWORDS:
#+DESCRIPTION:
#+TAGS:
#+LANGUAGE: en
#+OPTIONS: toc:nil
#+PANDOC_OPTIONS:
#+STARTUP: hidestars showall

** number of articles
#+BEGIN_SRC sh :dir /hadoopext:vossanto
  for i in $(seq 1987 2007); do
    echo -ne "$i\t"
    tar tzvf nyt_corpus_$i.tar.gz | grep "xml$" | wc -l
  done
#+END_SRC

|  year | articles |
|-------+----------|
|  1987 |   106104 |
|  1988 |   104541 |
|  1989 |   102818 |
|  1990 |    98812 |
|  1991 |    85135 |
|  1992 |    82685 |
|  1993 |    79200 |
|  1994 |    74925 |
|  1995 |    85392 |
|  1996 |    79077 |
|  1997 |    85396 |
|  1998 |    89163 |
|  1999 |    91074 |
|  2000 |    94258 |
|  2001 |    96282 |
|  2002 |    97258 |
|  2003 |    94235 |
|  2004 |    91362 |
|  2005 |    90004 |
|  2006 |    87052 |
|  2007 |    39953 |
|-------+----------|
| *sum* |  1854726 |
#+TBLFM: @23$2=vsum(@I..@II)

** number of vossantos

#+begin_src emacs-lisp :results none
(setq org-babel-python-command "python3")
#+end_src

#+BEGIN_SRC python :results output table raw
  year = None
  count = None
  with open("README.md", "r") as f:
      for line in f:
          # find "## Examples"
          if line.startswith("## Examples"):
              year = 0
              continue
          # find "### YEAR"
          if year is not None and line.startswith("### "):
              # output count for previous year
              if year > 0:
                  print(year, count, sep='\t')
              year = int(line[4:8])
              count = 0
              continue
          # find Vossantos
          if year is not None and year > 0 and line.startswith("- "):
              count += 1
              continue
      print(year, count, sep='\t')
#+END_SRC

#+RESULTS:
1987	19
1988	17
1989	20
1990	24
1991	20
1992	24
1993	28
1994	28
1995	26
1996	24
1997	35
1998	38
1999	35
2000	36
2001	30
2002	38
2003	39
2004	38
2005	35
2006	30
2007	13

** final result

# plot with: M-x org-plot/gnuplot
#+PLOT: title:"Vossanto" ind:1 deps:(4) type:2d with:linespoints set:grid
|  year | articles |   v01 |   v01% | VOSS01 | VOSS01‰ | prec01 |   v02 |   v02% |  v03 |   |
|-------+----------+-------+--------+--------+---------+--------+-------+--------+------+---|
|  1987 |   106104 |   792 |   7.46 |     19 |    0.18 |   2.41 |  1030 |   9.71 | 1127 |   |
|  1988 |   104541 |   734 |   7.02 |     17 |    0.16 |   2.28 |   963 |   9.21 | 1051 |   |
|  1989 |   102818 |   775 |   7.54 |     20 |    0.19 |   2.52 |   989 |   9.62 | 1067 |   |
|  1990 |    98812 |   668 |   6.76 |     24 |    0.24 |   3.55 |   860 |   8.70 |  946 |   |
|  1991 |    85135 |   583 |   6.85 |     20 |    0.23 |   3.36 |   781 |   9.17 |  861 |   |
|  1992 |    82685 |   605 |   7.32 |     24 |    0.29 |   3.96 |   777 |   9.40 |  854 |   |
|  1993 |    79200 |   503 |   6.35 |     28 |    0.35 |   5.51 |   658 |   8.31 |  742 |   |
|  1994 |    74925 |   540 |   7.21 |     28 |    0.37 |   5.13 |   689 |   9.20 |  749 |   |
|  1995 |    85392 |   626 |   7.33 |     26 |    0.30 |   4.09 |   790 |   9.25 |  853 |   |
|  1996 |    79077 |   584 |   7.39 |     24 |    0.30 |   4.06 |   773 |   9.78 |  841 |   |
|  1997 |    85396 |   632 |   7.40 |     35 |    0.41 |   5.54 |   781 |   9.15 |  835 |   |
|  1998 |    89163 |   667 |   7.48 |     38 |    0.43 |   5.75 |   859 |   9.63 |  925 |   |
|  1999 |    91074 |   604 |   6.63 |     35 |    0.38 |   5.73 |   822 |   9.03 |  881 |   |
|  2000 |    94258 |   420 |   4.46 |     36 |    0.38 |   8.52 |   604 |   6.41 |  654 |   |
|  2001 |    96282 |   365 |   3.79 |     30 |    0.31 |   8.18 |   525 |   5.45 |  585 |   |
|  2002 |    97258 |   340 |   3.50 |     38 |    0.39 |  11.14 |   497 |   5.11 |  574 |   |
|  2003 |    94235 |   331 |   3.51 |     39 |    0.41 |  11.68 |   535 |   5.68 |  609 |   |
|  2004 |    91362 |   294 |   3.22 |     38 |    0.42 |  13.04 |   487 |   5.33 |  533 |   |
|  2005 |    90004 |   300 |   3.33 |     35 |    0.39 |  11.71 |   466 |   5.18 |  517 |   |
|  2006 |    87052 |   260 |   2.99 |     30 |    0.34 |  11.37 |   405 |   4.65 |  457 |   |
|  2007 |    39953 |   121 |   3.03 |     13 |    0.33 |  10.89 |   187 |   4.68 |  211 |   |
|-------+----------+-------+--------+--------+---------+--------+-------+--------+------+---|
| *sum* |  1854726 | 10744 | 120.57 |    597 |    0.31 | 140.42 | 14478 | 162.65 |      |   |
| *avg* |    88320 |   512 |   5.74 |     28 |    0.32 |   6.69 |   689 |   7.75 |      |   |
#+TBLFM: $4=($-1/$2)*1000;%0.2f::$6=($-1/$-4)*1000;%0.2f::$7=($-1/$-3)*100;%0.2f::$9=($-1/$2)*1000;%0.2f::@23$2=vsum(@I..@II)::@23$3=vsum(@I..@II)::@23$4=vsum(@I..@II)::@23$5=vsum(@I..@II)::@23$7=vsum(@I..@II)::@23$8=vsum(@I..@II)::@23$9=vsum(@I..@II)::@24$2=@-1/vlen(@I..@II);%0.0f::@24$3=@-1/vlen(@I..@II);%0.0f::@24$4=@-1/vlen(@I..@II);%0.2f::@24$5=@-1/vlen(@I..@II);%0.0f::@24$7=@-1/vlen(@I..@II);%0.2f::@24$8=@-1/vlen(@I..@II);%0.0f::@24$9=@-1/vlen(@I..@II);%0.2f


*** Places

#+BEGIN_SRC sh :results raw output
  URL=http://data.okfn.org/data/core/country-list/r/data.csv
  for COUNTRY in $(wget -q -O - "$URL" | tail -n +2 data.csv | sed -e "s/ /_/g" -e "s/\"//"| awk -F',' '{print $1}' | sort -u); do
    COUNTRY=$(echo $COUNTRY | sed "s/_/ /g")
    MATCHES=$(grep "$COUNTRY" README.md)
    if [ "$MATCHES" ]; then
      echo "- $COUNTRY ::"
      grep "^-.*$COUNTRY" README.md | sed "s/^/  /"
    fi
  done
#+END_SRC

#+RESULTS:
- Afghanistan ::
  - *Faryab* is the *Wild West* of *Afghanistan* (2005/09/18/1703218)
- Argentina ::
  - *Cordoba*, the *Omaha* of *Argentina* (1998/11/22/1063995)
- Australia ::
  - *Business Review Weekly*, the *Australian equivalent* of *Business Week* (1997/09/13/0957036)
- Brazil ::
  - *Dr. Oswaldo Cruz*, the *Walter Reed* of *Brazil* (1989/11/26/0304421)
  - *Oscar*, the *Larry Bird* of *Brazil* (1990/07/29/0372556)
  - *Tom Ze*, the *Tristan Tzara* of *Brazilian Tropicalia* (1999/10/03/1142247)
  - *Ghana* is the *Brazil* of *Africa* (2006/06/28/1772401)
- Canada ::
  - *Windsor* is the *Detroit* of *Canada* (1987/09/21/0076414)
  - *Winnipeg* is the *Green Bay* of *Canada* (1991/11/25/0489598)
  - *Canada* is the *Death Star* of *cultural fortifications* (1999/07/14/1123261)
- China ::
  - *Wei Jingsheng*, the *Sakharov* of *China* (1996/12/09/0894541)
  - *John Rabe* is the *Oskar Schindler* of *China* (1996/12/12/0895003)
  - *Sunset Park*, the *Chinatown* of *Brooklyn* (2006/04/09/1753245)
- Colombia ::
  - *Colombia* is the *South Korea* of *flower exporters* (1989/09/20/0284628)
  - *Colombia*, the *Fort Knox* of *ransom proceeds* (1998/08/09/1037554)
- Denmark ::
  - *Denmark* is the *Hong Kong* of *Europe* (1993/04/01/0599397)
- Egypt ::
  - *Mabahith*, the *Egyptian equivalent* of the *F.B.I.* (2005/04/08/1663228)
- France ::
  - *Jean-Claude Gallotta*, the *Mark Morris* of *France* (1992/12/14/0576566)
  - *Canal Plus*, the *HBO* of *France* (1994/03/27/0676813)
- Georgia ::
  - *New South Wales*, the *Georgian equivalent* of *deep space* (1987/01/25/0007151)
  - the *Appalachian Trail* marching grandly from Georgia to Maine, the *Holy Grail* of *thousands of hikers* (1998/07/10/1030659)
- Germany ::
  - *Heiner Goebbels*, the *John Zorn* of *West Germany* (1989/11/10/0299484)
- Ghana ::
  - *Ghana* is the *Brazil* of *Africa* (2006/06/28/1772401)
- Hong Kong ::
  - *Denmark* is the *Hong Kong* of *Europe* (1993/04/01/0599397)
- India ::
  - *Bangalore*, India, the *Silicon Valley* of *South Asia* (1997/06/19/0938068)
  - *Azim Premji* is the *Bill Gates* of *India* (2004/03/21/1568087)
- Iraq ::
  - "If *bin Laden* is the *Robin Hood* of *jihad*," the authors write, then *Abu Musab al-Zarqawi* "has been its *Horatio Alger*, and *Iraq* his *field of dreams*." (2005/11/20/1719129)
- Ireland ::
  - *Gay Byrne*, the *Johnny Carson* of *Ireland* (1991/11/13/0486648)
- Israel ::
  - "Some people say *Claire Shulman* is the *Golda Meir* of *Queens*. [...] I say *Golda Meir* was the *Claire Shulman* of *Israel*." (1996/05/21/0852275)
  - *Benjamin Netanyahu* is the *Ronald Reagan* of *Israel*  (1998/01/20/0989013)
- Italy ::
  - *Italy* is the *Boston Red Sox* of *soccer* (2002/05/26/1395524)
- Japan ::
  - *Hiroshi Itsuki*, the *Frank Sinatra* of *Japan* (1987/06/29/0052991)
  - *Japan*, the *Everest* of *export markets* (1992/05/01/0524977)
  - *NHK*, the *BBC* of *Japan* (1998/10/11/1053265)
  - *Shimano of Japan*, the *Microsoft* of *bicycle-part makers* (1999/03/11/1091448)
  - *Yoshinori Watanabe*, the *Japanese godfather* of the *yakuza* (2000/04/02/1188831)
  - *Yasujiro Ozu*, the *Japanese master* of *emotional understatement* (2003/08/08/1510478)
  - *Yomiuri Giants*, the *Japanese equivalent* of the *Yankees* (2004/03/28/1569955)
  - *Oden* is the *Japanese equivalent* of *chicken soup* (2004/03/10/1565172)
  - *Biz Cool*, the *Japanese equivalent* of *business casual* (2006/06/24/1771315)
- Jersey ::
  - *New Jersey*, the *Charlie Brown* of *franchises* (1996/05/26/0853475)
  - *Jersey Shore*, the *Land* of *Imposition* (2002/07/28/1411586)
  - *Frank Lautenberg*, the *Rosie Ruiz* of the *New Jersey race* (2002/10/30/1436301)
  - *New Jersey's Vince Lombardi* is the *Yosemite* of *rest stops* (2003/02/02/1461651)
  - *Arturo Gatti* is the *Oscar De La Hoya* of *New Jersey* (2004/02/22/1560800)
- Jordan ::
  - But if *Jordan* is the *Chuck Yeager* of *basketball*, *Julius Erving* was its *Charles Lindbergh* and *Connie Hawkins* was its *Wright Brothers*. (1992/05/07/0526474)
  - *Romario* is the *Michael Jordan* of *soccer* and *Bebeto* is the *Magic Johnson* of *soccer* (1994/07/05/0697643)
  - *Michael Jordan* is the *God* of *Chicago* (1995/03/12/0748227)
  - *Jordan*, the *Seinfeld* of *sports* (1998/05/29/1020525)
  - *Bonfire*, the *Michael Jordan* of *dressage horses* (1998/11/05/1059693)
  - *Brian Foster*, the *Michael Jordan* of *BMX racing* (1998/12/27/1072824)
  - The stunt biker *Dave Mirra*, the *Michael Jordan* of the *dirt set* (2000/08/13/1222322)
  - *Cynthia Cooper* is the *Michael Jordan*, the *Larry Bird*, the *Magic Johnson* of *this league* (2000/08/28/1226010)
  - *McNabb* has been called the *Michael Jordan* of the *National Football League* (2001/01/08/1261308)
- Korea ::
  - *Colombia* is the *South Korea* of *flower exporters* (1989/09/20/0284628)
- Mexico ::
  - *Virginia Gonzalez*  is the *Dorothea Dix* of *Mexico* (2000/01/16/1168831)
  - *Las Cruces*, the *Mesilla Valley* of *southern New Mexico* (2003/03/09/1470804)
  - *Puebla* is the *Lyon* of *Mexico* (2005/11/20/1718800)
- Portugal ::
  - *Algarve*, the *Riviera* of *Portugal* (1987/06/14/0048773)
- Saudi Arabia ::
  - *Saudi Arabia* is the *Augusta National* of *Islam* (2002/11/17/1441420)
  - If the *vast, empty plain of eastern Montana* is the *Saudi Arabia* of *coal*, then *Gov. Brian Schweitzer* may be its *Lawrence*. (2005/11/21/1719391)
- Spain ::
  - *Savannah*, the *Central Park* of the capital, *Port of Spain* (1999/08/11/1129887)
- Sweden ::
  - *Sweden*, the *Rangers* of *international hockey* (1994/02/12/0668308)
- Taiwan ::
  - *Hsinchu Science Park*, *Silicon Valley* of *Taiwan* (1999/09/22/1139658)
- United States ::
  - *Sassy*, the *United States version* of *Dolly* (1987/08/24/0068801)
  - the *Presidency of the United States* is the *Holy Grail* of *world politics* (1996/01/21/0824276)


#+BEGIN_SRC sh :results raw output
  grep -E -i Europe README.md
#+END_SRC

- *Europcar*, the *European counterpart* of *National Car Rental* (1989/03/05/0228921)
- *Denmark* is the *Hong Kong* of *Europe* (1993/04/01/0599397)
- *Hulton Deutsch*, the *European equivalent* of the *Bettman Archive* (1997/05/18/0930910)
- *Latin*, the *European language* of *learning* (1998/01/03/0984739)
- *Eurosport*, the *European equivalent* of *ESPN* (1998/02/23/0997564)

#+BEGIN_SRC sh :results raw output
  grep -E -i London README.md
#+END_SRC

- *Olivier Awards*, the *London equivalent* of the *Tony Awards* (2000/07/05/1212567)
- If *Kelly Hoppen* is the *Design Diva* of *London*, then *Rita Konig* is the *Design It Girl*. (2002/12/26/1451541)
- *Olivier Award*, the *London equivalent* of the *Tony* (2003/03/02/1468848)
- *Chalkhill Estates in London*, the *British equivalent* of a *housing project* (2006/11/01/1801327)

#+BEGIN_SRC sh :results raw output
  grep -E -i Paris README.md
#+END_SRC

- *La Villa*, the *Village Vanguard* of *Paris* (1995/01/15/0736911)
- *Biennale International des Antiquaries* in Paris, *Super Bowl* of *antique fairs* (2000/09/08/1228700)
- *L'Ami Louis*, the *Parisian temple* of *foie gras* (2002/11/06/1438122)
- If *Buenos Aires* is the *Paris* of *South America*, *Quebec City* is the *Paris* of *North America*. (2006/02/19/1740811)

#+BEGIN_SRC sh :results raw output
  grep -E -i "^-.*New York" README.md
#+END_SRC

- the *Giants*, the *New York Titans* of the *American Football League* (1987/01/28/0007820)
- "*New York State* is the *Cadillac* of *social services*," Mr. Alfonso said. "*Other states* have *Volkswagens*."  (1990/11/26/0404144)
- "*New York* is the *Cadillac* of *welfare states*," he said. "We can't afford it anymore. What we need is *Chevys* and *Fords* in this state." (1991/01/31/0419226)
- Forget the Yankees of Reggie, the Giants of Taylor, the Mets of Carter and Hernandez, even the Knicks of Reed and DeBusschere. The Islanders won like the old, old New York Yankees and they charmed like the old, old Brooklyn Dodgers (1992/03/04/0511581)
- *New York* is the *Gomorrah* of the *New World* (1995/04/09/0753967)
- *Peter Eisenman* of New York is the *Gertrude Stein* of *contemporary architecture* (1999/03/14/1092170)
- the *Bronx*, the *Riviera* of *New York City* (2000/07/09/1213712)
- the *Mighty Mose*, the *Paul Bunyan* of *New York* (2001/11/04/1339907)
- the *A-team in New York* is the *A-team* of *A-teams* (2002/01/21/1361231)
- *Terry Riley*, the *California Minimalist*; *Astor Piazzolla*, the *Argentine master* of the *nuevo tango*; and *John Zorn*, the *New York bender* of *genres* (2004/01/11/1549709)
- *Ravenswood* is the *Death Valley* of *New York City* (2005/07/23/1689358)
- *New York* is the *Mecca* of *basketball* (2007/04/05/1838196)


